# 슬라이스 사용
a=[0,10,20,30,40,50,60,70,80,90]
print(a[0:4])

# 리스트의 중간 부분 가져오기
print(a[4:7])
print(a[4:-1])

# 인덱스 증가폭 사용하기
print(a[2:8:3])
print(a[2:9:3])

# 인덱스 생략하기
print(a[:7])
print(a[7:])
print(a[:])

# 인덱스를 생략하면서 증가폭 사용
print(a[:7:2])
print(a[7::2])
print(a[::2])
print(a[::])

# len 응용
print(a[0:len(a)])
print(a[:len(a)])

# 튜플, range, 문자열에 슬라이스 사용하기
b=(0,10,20,30,40,50,60,70,80,90)
print(b[4:7])
print(b[4:])
print(b[:7:2])
r=range(10)
print(r[4:7],r[4:],r[:7:2],sep="\n")
print(list(r[:7:2]))
hello="Hello,world!"
print(hello[2:9],hello[2:],hello[:9:2],sep="\n")

# 슬라이스에 요소 할당
a=[0,10,20,30,40,50,60,70,80,90]
a[2:5]=["a","b","c"]
print(a)
a=[0,10,20,30,40,50,60,70,80,90]
a[2:5]=["a"]
print(a)
a=[0,10,20,30,40,50,60,70,80,90]
a[2:5]=["a","b","c","d","e"]
print(a)
a=[0,10,20,30,40,50,60,70,80,90]
a[2:8:2]=["a","b","c"]
print(a)

# del로 슬라이스 삭제하기
a=[0,10,20,30,40,50,60,70,80,90]
del a[2:5]
print(a)
a=[0,10,20,30,40,50,60,70,80,90]
del a[2:8:2]
print(a)